app/controllers/carts_controller.rb

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM `carts` WHERE `carts`.`id` = 3