app/controllers/line_items_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 ORDER BY title LIMIT 1
INSERT INTO `line_items` (`product_id`, `cart_id`, `created_at`, `updated_at`, `quantity`, `order_id`) VALUES (4, 6, '2012-09-12 08:07:28', '2012-09-12 08:07:28', 1, NULL)
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2012-09-12 03:52:11' WHERE `line_items`.`id` = 8
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save