app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc' ,
      :per_page => 15
---
SELECT COUNT(*) FROM `orders`
SELECT `orders`.* FROM `orders` ORDER BY created_at desc LIMIT 15 OFFSET 0

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT COUNT(*) FROM `line_items` WHERE (`line_items`.cart_id = 4)
SELECT `line_items`.* FROM `line_items` WHERE (`line_items`.cart_id = 4)

  def edit
    @order = Order.find(params[:id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 103 LIMIT 1

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2012-09-12 04:22:46', '2012-09-12 04:22:46')
INSERT INTO `orders` (`name`, `address`, `email`, `pay_type`, `created_at`, `updated_at`) VALUES ('Srikanth ', 'fgd dfg\r\ndg df\r\ngd \r\ng dfg', 'sri.jjerh@gmail.com', 'Credit card', '2012-09-12 04:22:07', '2012-09-12 04:22:07')
DELETE FROM `carts` WHERE `carts`.`id` = 4
SELECT `line_items`.* FROM `line_items` WHERE (`line_items`.order_id = 102)